/**
 * 孟加拉语（孟加拉国）：bn_BD
 * @description 孟加拉语（孟加拉国）语言包
 * @author KwooShung，Google Translate
 * @createat 2023-11-03 19:59:15
 */

export default {
  common: {
    error: 'এক্সিকিউশন কমান্ড ব্যর্থ হয়েছে: {0}',
    syncCompleted: 'সম্পূর্ণ সম্পূর্ণ।',
    invalidChoice: 'অবৈধ পছন্দ',
    executionSucceeded: 'কার্যকর করা সফল',
    executionFailed: 'কার্যকরকরণ ব্যর্থতা',
    backToMenu: 'প্রত্যাবর্তন',
    exit: 'প্রস্থান'
  },
  loading: {
    revokingCurrent: 'বর্তমান সংস্করণ প্রত্যাহার করা হচ্ছে ...',
    revokingVersion: 'পুনর্বিবেচনা সংস্করণ: v{0} ...',
    specificVersion: 'সংস্করণটি হিসাবে উল্লেখ করুন: v{0} ...',
    upgradingVersion: 'আপগ্রেড ভি {0}: ভি {1}> ভি {2} ...'
  },
  version: {
    major: 'প্রধান সংস্করণ',
    minor: 'মাধ্যমিক সংস্করণ',
    patch: 'প্যাচ',
    tips: {
      firstTimePrompt: 'যেহেতু আপনি সংস্করণটি প্রকাশ করেন নি, আপনাকে এটি প্রথমবারের জন্য প্রকাশ করতে হবে।',
      failedToIncrement: 'সংস্করণ নম্বর বাড়াতে পারে না',
      invalidVersionField: 'প্যাকেজ.জসন -এ সংস্করণ ক্ষেত্রগুলি অনুপস্থিত বা অবৈধ',
      enterInitialVersion: 'আপনার প্রাথমিক সংস্করণ নম্বর লিখুন, ডিফল্ট 0.0.1:',
      error: 'দয়া করে একটি কার্যকর শব্দার্থক সংস্করণ নম্বর লিখুন, উদাহরণস্বরূপ: ভি {0}'
    }
  },
  menus: {
    main: {
      prompt: 'আপনি কি করতে যাচ্ছেন?',
      upgradeVersion: 'নতুন সংস্করণ',
      specificVersion: 'নির্দিষ্ট সংস্করণ',
      revokeVersion: 'প্রত্যাখ্যান সংস্করণ'
    },
    upgrade: {
      prompt: 'আপনি কোন সংস্করণ আপগ্রেড করার পরিকল্পনা করছেন?',
      confirmPush: 'গুদামে সংস্করণটি ঠেলে দেওয়া উচিত কিনা'
    },
    specificVersion: {
      prompt: 'সংস্করণ নম্বর লিখুন:',
      confirm: "আপনার বর্তমান সংস্করণ নম্বরটি হ'ল: v{0}, নিশ্চিত করুন যে আপনি নির্দিষ্ট সংস্করণ নম্বরটি প্রবেশ করুন: v{1}"
    },
    revoke: {
      prompt: 'আপনি কোন সংস্করণটি প্রত্যাহার করার পরিকল্পনা করছেন?',
      currentVersion: 'বর্তমান সংস্করণ',
      specificVersion: 'নির্দিষ্ট সংস্করণ'
    },
    revokeCurrentVersion: {
      retainChanges: 'ফাইলগুলির পরিবর্তন সংরক্ষণ করুন, কেবল সংস্করণ নম্বর বাতিল করা হয়েছে',
      confirm: "আপনার বর্তমান সংস্করণ নম্বরটি হ'ল: v{0}, বাতিল হওয়ার পরে: v{1}, আপনি কি চালিয়ে যান?"
    },
    revokeSpecificVersion: {
      prompt: 'প্রত্যাহার করতে দয়া করে সংস্করণ নম্বরটি প্রবেশ করুন:',
      retainChanges: 'ফাইলগুলির পরিবর্তন সংরক্ষণ করুন, কেবল সংস্করণ নম্বর বাতিল করা হয়েছে',
      confirm: "আপনার বর্তমান সংস্করণ নম্বরটি হ'ল: v{0}, বাতিল হওয়ার পরে: v{1}, আপনি কি চালিয়ে যান?"
    },
    revertToPreviousVersion: {
      updatePackageJson: 'প্যাকেজ.জসন ফাইলের সংস্করণ নম্বরটি কিনা: ভি {0} প্রত্যাহার করা সংস্করণ নম্বর হিসাবেv{1} হিসাবে আপডেট করা হয়েছে',
      failedToRetrieve: 'পূর্ববর্তী জমা থেকে সংস্করণ নম্বরটি পুনরুদ্ধার করা অসম্ভব, এবং প্যাকেজ.জসন ফাইলের সংস্করণ নম্বরটি আপাতত সংশোধন করা হয়নি। প্রয়োজনে ম্যানুয়ালি সংশোধন করুন।'
    }
  }
};
