/**
 * 亚美尼亚语：hy_AM
 * @description 亚美尼亚语语言包
 * @author KwooShung，Google Translate
 * @createat 2023-11-03 20:19:32
 */

export default {
  common: {
    error: 'Կատարման հրամանը ձախողվեց. {0',
    syncCompleted: 'Ամբողջովին ամբողջական:',
    invalidChoice: 'Անվավեր ընտրություն',
    executionSucceeded: 'Կատարումը հաջողության է հասնում',
    executionFailed: 'Կատարման ձախողում',
    backToMenu: 'վերադարձ',
    exit: 'թողնել'
  },
  loading: {
    revokingCurrent: 'Ներկայիս վարկածը ուժը կորցրած է ճանաչվում ...',
    revokingVersion: 'Վերանայվող տարբերակը. V {0 ...',
    specificVersion: 'Նշեք վարկածը որպես v {0 ...',
    upgradingVersion: 'Թարմացում{0}: v{1} > v{2} ...'
  },
  version: {
    major: 'Հիմնական տարբերակը',
    minor: 'Միջնակարգ տարբերակ',
    patch: 'Կարկատել',
    tips: {
      firstTimePrompt: 'Քանի որ դուք չեք հրապարակել վարկածը, անհրաժեշտ է առաջին անգամ ազատել այն:',
      failedToIncrement: 'Չի կարող մեծացնել վարկածի համարը',
      invalidVersionField: 'Package.json- ի վարկածի դաշտերը բացակայում են կամ անվավեր են',
      enterInitialVersion: 'Մուտքագրեք ձեր նախնական վարկածի համարը, լռելյայն 0.0.1.',
      error: 'Խնդրում ենք մուտքագրել արդյունավետ իմաստաբանական տարբերակի համարը, օրինակ,v{0}'
    }
  },
  menus: {
    main: {
      prompt: 'Ինչ ես պատրաստվում անել?',
      upgradeVersion: 'Թարմացված տարբերակը',
      specificVersion: 'Նշված տարբերակը',
      revokeVersion: 'Մերժված տարբերակը'
    },
    upgrade: {
      prompt: 'Որ տարբերակն եք նախատեսում արդիականացնել',
      confirmPush: 'Արդյոք վարկը պահելու համար'
    },
    specificVersion: {
      prompt: 'Մուտքագրեք վարկածի համարը.',
      confirm: 'Ձեր ընթացիկ վարկածի համարը հետեւյալն է.v{0}, Հաստատեք, որ մուտքագրեք նշված տարբերակի համարը,v{1}'
    },
    revoke: {
      prompt: 'Որ տարբերակն եք նախատեսում հետ կանչել',
      currentVersion: 'ընթացիկ տարբերակը',
      specificVersion: 'Նշված տարբերակը'
    },
    revokeCurrentVersion: {
      retainChanges: 'Ամրագրեք ֆայլերի փոփոխությունը, միայն վարկածի համարը չեղյալ է հայտարարվում',
      confirm: 'Ձեր ընթացիկ վարկածի համարը `v{0}, չեղյալ հայտարարումից հետո.v{1}, Շարունակում եք:'
    },
    revokeSpecificVersion: {
      prompt: 'Խնդրում ենք մուտքագրել վարկածի համարը, որը պետք է հանվի.',
      retainChanges: 'Ամրագրեք ֆայլերի փոփոխությունը, միայն վարկածի համարը չեղյալ է հայտարարվում',
      confirm: 'Ձեր ընթացիկ վարկածի համարը `v{0}, չեղյալ հայտարարումից հետո.v{1}, Շարունակում եք:'
    },
    revertToPreviousVersion: {
      updatePackageJson: 'Անկախ նրանից, թե արդյոք փաթեթի վարկածը',
      failedToRetrieve:
        'Նախորդ ներկայացումից հնարավոր չէ վերականգնել վարկածի համարը, եւ փաթեթի վարկածի համարը: Json ֆայլը ժամանակ առ ժամանակ փոփոխված չէ: Անհրաժեշտության դեպքում խնդրում ենք ձեւափոխել ձեռքով:'
    }
  }
};
