/**
 * 格鲁吉亚语：ka_GE
 * @description 格鲁吉亚语语言包
 * @author KwooShung，Google Translate
 * @createat 2023-11-03 20:26:00
 */

export default {
  common: {
    error: 'შესრულების ბრძანება ვერ მოხერხდა: {0}',
    syncCompleted: 'სრულიად სრულყოფილი.',
    invalidChoice: 'არასწორი არჩევანი',
    executionSucceeded: 'აღსრულება წარმატებას',
    executionFailed: 'აღსრულების უკმარისობა',
    backToMenu: 'დაბრუნების',
    exit: 'მიტოვება'
  },
  loading: {
    revokingCurrent: 'მიმდინარე ვერსია გაუქმებულია ...',
    revokingVersion: 'გადასინჯული ვერსია: v{0} ...',
    specificVersion: 'მიუთითეთ ვერსია: v{0} ...',
    upgradingVersion: 'განახლება{0}: v{1} > v{2} ...'
  },
  version: {
    major: 'მთავარი ვერსია',
    minor: 'მეორადი ვერსია',
    patch: 'საკეტი',
    tips: {
      firstTimePrompt: 'მას შემდეგ, რაც თქვენ არ გამოაქვეყნეთ ვერსია, პირველად უნდა გაათავისუფლოთ იგი.',
      failedToIncrement: 'ვერსიის ნომრის გაზრდა შეუძლებელია',
      invalidVersionField: 'ვერსიის ველები პაკეტში. Json აკლია ან არასწორია',
      enterInitialVersion: 'გთხოვთ, შეიყვანოთ თქვენი საწყისი ვერსიის ნომერი, ნაგულისხმევი v{0}:',
      error: 'გთხოვთ, შეიყვანოთ ეფექტური სემანტიკური ვერსიის ნომერი, მაგალითად: v{0}'
    }
  },
  menus: {
    main: {
      prompt: 'Რას აპირებ?',
      upgradeVersion: 'განახლებული ვერსია',
      specificVersion: 'მითითებული ვერსია',
      revokeVersion: 'უარყოფილი ვერსია'
    },
    upgrade: {
      prompt: 'რომელი ვერსიის განახლებას აპირებთ',
      confirmPush: 'თუ არა ვერსია საწყობში გადასასვლელად'
    },
    specificVersion: {
      prompt: 'გთხოვთ, შეიყვანოთ ვერსიის ნომერი:',
      confirm: 'თქვენი ამჟამინდელი ვერსიის ნომერია: v{0}, დაადასტურეთ, რომ შეიყვანთ მითითებულ ვერსიის ნომერი: v{1}'
    },
    revoke: {
      prompt: 'რომელი ვერსიის გაუქმებას აპირებთ',
      currentVersion: 'მოქმედი ვერსია',
      specificVersion: 'მითითებული ვერსია'
    },
    revokeCurrentVersion: {
      retainChanges: 'შეიტანეთ ფაილების შეცვლა, მხოლოდ ვერსიის ნომერი გაუქმებულია',
      confirm: 'თქვენი ამჟამინდელი ვერსიის ნომერია: v{0}, გაუქმების შემდეგ: v{1}, განაგრძობთ?'
    },
    revokeSpecificVersion: {
      prompt: 'გთხოვთ, შეიყვანოთ ვერსიის ნომერი, რომ გაუქმდეს:',
      retainChanges: 'შეიტანეთ ფაილების შეცვლა, მხოლოდ ვერსიის ნომერი გაუქმებულია',
      confirm: 'თქვენი ამჟამინდელი ვერსიის ნომერია: v{0}, გაუქმების შემდეგ: v{1}, განაგრძობთ?'
    },
    revertToPreviousVersion: {
      updatePackageJson: 'განახლებულია თუ არა პაკეტის',
      failedToRetrieve:
        'შეუძლებელია ვერსიის ნომრის მიღება წინა წარდგენიდან, ხოლო პაკეტში არსებული ვერსიის ნომერი. JSON ფაილში არ არის შეცვლილი ამ დროისთვის. საჭიროების შემთხვევაში, გთხოვთ, შეცვალოთ ხელით.'
    }
  }
};
