/**
 * 高棉语：km_KH
 * @description 高棉语语言包
 * @author KwooShung，Google Translate
 * @createat 2023-11-03 20:27:25
 */

export default {
  common: {
    error: 'ពាក្យបញ្ជាប្រតិបត្តិបានបរាជ័យ: {0}',
    syncCompleted: 'បញ្ចប់ទាំងស្រុង។',
    invalidChoice: 'ជម្រើសមិនត្រឹមត្រូវ',
    executionSucceeded: 'ការប្រតិបត្តិជោគជ័យ',
    executionFailed: 'ការបរាជ័យនៃការប្រតិបត្តិ',
    backToMenu: 'រតលប់',
    exit: 'ចាកចេញ'
  },
  loading: {
    revokingCurrent: 'កំណែបច្ចុប្បន្នកំពុងត្រូវបានដកហូតវិញ ...',
    revokingVersion: 'កំណែដែលអាចពិនិត្យឡើងវិញបាន: v{0} ...',
    specificVersion: 'បញ្ជាក់កំណែជា: v{0} ...',
    upgradingVersion: 'ធ្វើឱ្យប្រសើរឡើង{0}: v{1} > v{2} ...'
  },
  version: {
    major: 'កំណែសំខាន់',
    minor: 'កំណែមធ្យមសិក្សា',
    patch: 'បមនហ',
    tips: {
      firstTimePrompt: 'ចាប់តាំងពីអ្នកមិនបានចេញផ្សាយកំណែអ្នកត្រូវដោះលែងវាជាលើកដំបូង។',
      failedToIncrement: 'មិនអាចបង្កើនលេខកំណែបានទេ',
      invalidVersionField: 'វាលកំណែក្នុងកញ្ចប់ .json កំពុងបាត់ឬមិនត្រឹមត្រូវ',
      enterInitialVersion: 'សូមបញ្ចូលលេខកំណែដំបូងរបស់អ្នកលំនាំដើម v{0}:',
      error: 'សូមបញ្ចូលលេខកំណែកំណែដែលមានប្រសិទ្ធិភាពឧទាហរណ៍: v{0}'
    }
  },
  menus: {
    main: {
      prompt: 'តើ​អ្នក​នឹង​ធ្វើអ្វី?',
      upgradeVersion: 'កំណែដែលបានធ្វើបច្ចុប្បន្នភាព',
      specificVersion: 'កំណែដែលបានបញ្ជាក់',
      revokeVersion: 'បានបដិសេធកំណែ'
    },
    upgrade: {
      prompt: 'តើអ្នកមានគម្រោងធ្វើឱ្យប្រសើរឡើងជំនាន់ណា',
      confirmPush: 'ថាតើត្រូវជំរុញកំណែទៅឃ្លាំង'
    },
    specificVersion: {
      prompt: 'សូមបញ្ចូលលេខកំណែ:',
      confirm: 'លេខកំណែបច្ចុប្បន្នរបស់អ្នកគឺ: v{0} បញ្ជាក់ថាអ្នកបញ្ចូលលេខកំណែដែលបានបញ្ជាក់: v{1}'
    },
    revoke: {
      prompt: 'តើអ្នកមានគម្រោងលុបចោលជំនាន់ណា',
      currentVersion: 'កំណែបច្ចុប្បន្ន',
      specificVersion: 'កំណែដែលបានបញ្ជាក់'
    },
    revokeCurrentVersion: {
      retainChanges: 'រកឃើញការផ្លាស់ប្តូរឯកសារមានតែលេខកំណែប៉ុណ្ណោះដែលត្រូវបានដកហូត',
      confirm: 'លេខកំណែបច្ចុប្បន្នរបស់អ្នកគឺ: v{0} បន្ទាប់ពីការលុបចោល: v{1} តើអ្នកបន្តទេ?'
    },
    revokeSpecificVersion: {
      prompt: 'សូមបញ្ចូលលេខកំណែដែលត្រូវដកហូតវិញ:',
      retainChanges: 'រកឃើញការផ្លាស់ប្តូរឯកសារមានតែលេខកំណែប៉ុណ្ណោះដែលត្រូវបានដកហូត',
      confirm: 'លេខកំណែបច្ចុប្បន្នរបស់អ្នកគឺ: v{0} បន្ទាប់ពីការលុបចោល: v{1} តើអ្នកបន្តទេ?'
    },
    revertToPreviousVersion: {
      updatePackageJson: 'ថាតើលេខកំណែនៅក្នុងឯកសារកញ្ចប់។ ជំពូក: v{0} ត្រូវបានធ្វើបច្ចុប្បន្នភាពថាជាលេខទូរស័ព្ទដែលបានដកហូតv{1}',
      failedToRetrieve: 'វាមិនអាចទៅរួចទេក្នុងការទាញយកលេខកំណែពីការដាក់ស្នើមុននិងលេខកំណែនៅក្នុងឯកសារកញ្ចប់ .json មិនត្រូវបានកែប្រែទេ។ បើចាំបាច់សូមកែប្រែដោយដៃ។'
    }
  }
};
