/**
 * 马拉雅拉姆语：ml_IN
 * @description 马拉雅拉姆语语言包
 * @author KwooShung，Google Translate
 * @createat 2023-11-03 20:38:27
 */

export default {
  common: {
    error: 'എക്സിക്യൂഷൻ കമാൻഡ് പരാജയപ്പെട്ടു: {0}',
    syncCompleted: 'പൂർണ്ണമായും പൂർത്തിയാക്കുക.',
    invalidChoice: 'അസാധുവായ തിരഞ്ഞെടുപ്പ്',
    executionSucceeded: 'വധശിക്ഷ വിജയം',
    executionFailed: 'വധശിക്ഷ പരാജയം',
    backToMenu: 'മടങ്ങിവരുക',
    exit: 'ഉപേക്ഷിക്കുക'
  },
  loading: {
    revokingCurrent: 'നിലവിലെ പതിപ്പ് അസാധുവാക്കലാണ് ...',
    revokingVersion: 'പുനരുജ്ജീവദ്ധമായ പതിപ്പ്: v{0} ...',
    specificVersion: 'IVES: v{0} ...',
    upgradingVersion: 'അപ്ഗ്രേഡ്v{0}: v{1} > v{2} ...'
  },
  version: {
    major: 'പ്രധാന പതിപ്പ്',
    minor: 'ദ്വിതീയ പതിപ്പ്',
    patch: 'തുണിത്തുണ്ട്',
    tips: {
      firstTimePrompt: 'നിങ്ങൾ പതിപ്പ് പുറത്തിറക്കാത്തതിനാൽ, നിങ്ങൾ ആദ്യമായി ഇത് റിലീസ് ചെയ്യേണ്ടതുണ്ട്.',
      failedToIncrement: 'പതിപ്പ് നമ്പർ വർദ്ധിപ്പിക്കാൻ കഴിയില്ല',
      invalidVersionField: 'പാക്കേജിലെ പതിപ്പ് ഫീൽഡുകൾ. ജെസണിനെ കാണുന്നില്ല അല്ലെങ്കിൽ അസാധുവാണ്',
      enterInitialVersion: 'നിങ്ങളുടെ പ്രാരംഭ പതിപ്പ് നമ്പർ, സ്ഥിരസ്ഥിതി 0.0.1 എന്നിവ നൽകുക:',
      error: 'ഉദാഹരണത്തിന് / ഫലപ്രദമായ സെമാന്റിക് പതിപ്പ് നമ്പർ നൽകുക, ഉദാഹരണത്തിന്: v{0}'
    }
  },
  menus: {
    main: {
      prompt: 'നീ എന്തുചെയ്യാൻ പോകുന്നു?',
      upgradeVersion: 'അപ്ഡേറ്റുചെയ്ത പതിപ്പ്',
      specificVersion: 'നിർദ്ദിഷ്ട പതിപ്പ്',
      revokeVersion: 'നിരസിച്ച പതിപ്പ്'
    },
    upgrade: {
      prompt: 'ഏത് പതിപ്പാണ് അപ്ഗ്രേഡുചെയ്യാൻ നിങ്ങൾ പദ്ധതിയിടുന്നത്',
      confirmPush: 'പതിപ്പ് വെയർഹൗസിലേക്ക് തള്ളിയാക്കണോ എന്ന്'
    },
    specificVersion: {
      prompt: 'പതിപ്പ് നമ്പർ നൽകുക:',
      confirm: 'നിങ്ങളുടെ നിലവിലെ പതിപ്പ് നമ്പർ: v{0}, നിങ്ങൾ നിർദ്ദിഷ്ട പതിപ്പ് നമ്പർ നൽകുമെന്ന് സ്ഥിരീകരിക്കുക: v{1}'
    },
    revoke: {
      prompt: 'ഏത് പതിപ്പാണ് നിങ്ങൾ അസാധുവാക്കാൻ പദ്ധതിയിടുന്നത്',
      currentVersion: 'നിലവിലുള്ള പതിപ്പ്',
      specificVersion: 'നിർദ്ദിഷ്ട പതിപ്പ്'
    },
    revokeCurrentVersion: {
      retainChanges: 'ഫയലുകളുടെ മാറ്റം റിസർവ് ചെയ്യുക, പതിപ്പ് നമ്പർ മാത്രം അസാധുവാക്കി',
      confirm: 'നിങ്ങളുടെ നിലവിലെ പതിപ്പ് നമ്പർ: v{0}, റദ്ദാക്കലിന് ശേഷം: v{1}, നിങ്ങൾ തുടരുകയാണോ?'
    },
    revokeSpecificVersion: {
      prompt: 'അസാധുവാക്കലിനായി പതിപ്പ് നമ്പർ നൽകുക:',
      retainChanges: 'ഫയലുകളുടെ മാറ്റം റിസർവ് ചെയ്യുക, പതിപ്പ് നമ്പർ മാത്രം അസാധുവാക്കി',
      confirm: 'നിങ്ങളുടെ നിലവിലെ പതിപ്പ് നമ്പർ: v{0}, റദ്ദാക്കലിന് ശേഷം: v{1}, നിങ്ങൾ തുടരുകയാണോ?'
    },
    revertToPreviousVersion: {
      updatePackageJson: 'പാക്കേജിലെ പതിപ്പ് നമ്പർ. ജെസൺ ഫയൽ: വി {0} അസാധുവായ പതിപ്പ് നമ്പർv{1} ആയി അപ്ഡേറ്റുചെയ്തു',
      failedToRetrieve:
        'മുമ്പത്തെ സമർപ്പണത്തിൽ നിന്ന് പതിപ്പ് നമ്പർ വീണ്ടെടുക്കുന്നതിന് കഴിയില്ല, കൂടാതെ പാക്കേജിലെ പതിപ്പ് നമ്പർ. ജെസൺ ഫയൽ ഇപ്പോഴത്തേക്ക് പരിഷ്ക്കരിക്കുന്നില്ല. ആവശ്യമെങ്കിൽ, സ്വമേധയാ പരിഷ്ക്കരിക്കുക.'
    }
  }
};
