/**
 * 蒙古语：mn_MN
 * @description 蒙古语语言包
 * @author KwooShung，Google Translate
 * @createat 2023-11-03 20:39:57
 */

export default {
  common: {
    error: 'Гүйцэтгэлийн тушаал амжилтгүй боллоо: {0}',
    syncCompleted: 'Бүрэн бүрэн гүйцэд.',
    invalidChoice: 'Стор тал',
    executionSucceeded: 'гүйцэтгэлд амжилтанд хүрэх',
    executionFailed: 'Биелэлт дутагдал',
    backToMenu: 'буцах',
    exit: 'орхих'
  },
  loading: {
    revokingCurrent: 'Одоогийн хувилбарыг хүчингүй болгож байна ...',
    revokingVersion: 'Revistiblebible хувилбар: v{0} ...',
    specificVersion: 'Хувилбарыг дараах байдлаар тодорхойлно уу: v{0} ...',
    upgradingVersion: 'Шинэчлэхv{0}: v{1}> v {2 {2} ...'
  },
  version: {
    major: 'Үнгийн хувилбар',
    minor: 'Хоёрны хоёр хувилбар',
    patch: 'Нөхөх',
    tips: {
      firstTimePrompt: 'Та хувилбарыг суллаагүй тул анх удаа үүнийг суллах хэрэгтэй.',
      failedToIncrement: 'Хувилбарын дугаарыг нэмэгдүүлэх боломжгүй байна',
      invalidVersionField: 'Багц дахь хувилбар талбарууд .Json байхгүй байна',
      enterInitialVersion: 'Эхний хувилбарын дугаараа оруулна уу, үндсэн v{0}:',
      error: 'Жишээ нь үр дүнтэй семантик хувилбарын дугаарыг оруулна уу: v{0}'
    }
  },
  menus: {
    main: {
      prompt: 'Чи юу хийх гэж байна?',
      upgradeVersion: 'Шинэчлэгдсэн хувилбар',
      specificVersion: 'Заасан хувилбар',
      revokeVersion: 'Татгалзсан хувилбар'
    },
    upgrade: {
      prompt: 'Та аль хувилбарыг шинэчлэхээр төлөвлөж байна вэ?',
      confirmPush: 'Хувилбарыг агуулах руу түлхэх эсэх'
    },
    specificVersion: {
      prompt: 'Хувилбарын дугаарыг оруулна уу:',
      confirm: 'Таны одоогийн хувилбарын дугаар: v{0} нь та заасан хувилбарын дугаарыг оруулаад баталгаажуулна уу: v{1}'
    },
    revoke: {
      prompt: 'Та аль хувилбарыг хүчингүй болгохоор төлөвлөж байна вэ?',
      currentVersion: 'Одоогийн хувилбар',
      specificVersion: 'Заасан хувилбар'
    },
    revokeCurrentVersion: {
      retainChanges: 'Файлын өөрчлөлтийг нөөцөлж, зөвхөн хувилбарын дугаарыг хүчингүй болгож байна',
      confirm: 'Таны одоогийн хувилбарын дугаар нь: v{0} нь цуцлагдсаны дараа: V {1 {1}, та үргэлжлүүлнэ үү?'
    },
    revokeSpecificVersion: {
      prompt: 'Хүчингүй болгохын тулд хувилбарын дугаарыг оруулна уу:',
      retainChanges: 'Файлын өөрчлөлтийг нөөцөлж, зөвхөн хувилбарын дугаарыг хүчингүй болгож байна',
      confirm: 'Таны одоогийн хувилбарын дугаар нь: v{0} нь цуцлагдсаны дараа: V {1 {1}, та үргэлжлүүлнэ үү?'
    },
    revertToPreviousVersion: {
      updatePackageJson: 'Багц дахь хувилбарын дугаар.v{0} нь хүчингүй хувилбарын дугаарыг хүчингүй болгож байнаv{1}',
      failedToRetrieve: 'Өмнөх илгээлтээс гарсан хувилбарын дугаарыг авах боломжгүй бөгөөд багц дахь хувилбарын дугаар. Шаардлагатай бол гараар өөрчлөх хэрэгтэй.'
    }
  }
};
