/**
 * 尼泊尔语：ne_NP
 * @description 尼泊尔语语言包
 * @author KwooShung，Google Translate
 * @createat 2023-11-03 20:45:28
 */

export default {
  common: {
    error: 'कार्यान्वयन आदेश असफल: {0}',
    syncCompleted: 'पूर्ण पूर्ण पूर्ण।',
    invalidChoice: 'अवैध विकल्प',
    executionSucceeded: 'कार्यान्वयन सफल भयो',
    executionFailed: 'कार्यान्वयन विफलता',
    backToMenu: 'फर्किनु',
    exit: 'छोड्नु'
  },
  loading: {
    revokingCurrent: 'वर्तमान संस्करण खारेज भइरहेको छ ...',
    revokingVersion: 'पुन: स्थायी संस्करण: v{0} ...',
    specificVersion: 'संस्करण निर्दिष्ट गर्नुहोस्: v{0} ...',
    upgradingVersion: 'अपग्रेडv{0}: v{1} > v{2} ...'
  },
  version: {
    major: 'मुख्य संस्करण',
    minor: 'माध्यमिक संस्करण',
    patch: 'टालो',
    tips: {
      firstTimePrompt: 'किनकि तपाईंले संस्करण छोड्नु भएको छैन, तपाईंले यसलाई पहिलो पटक रिहा गर्नु आवश्यक छ।',
      failedToIncrement: 'संस्करण नम्बर बढाउन सक्दैन',
      invalidVersionField: 'प्याकेजमा संस्करण क्षेत्रहरू .jsशोन हराइरहेको छ वा अवैध छन्',
      enterInitialVersion: 'कृपया तपाईंको प्रारम्भिक संस्करण नम्बर प्रविष्ट गर्नुहोस्, पूर्वनिर्धारित 0.0.0.1:',
      error: 'उदाहरणका लागि कृपया एक प्रभावशाली सिमेन्टिक संस्करण नम्बर प्रविष्ट गर्नुहोस्: v{0}'
    }
  },
  menus: {
    main: {
      prompt: 'तपाई के गर्न जाँदै हुनुहुन्छ?',
      upgradeVersion: 'अपडेट गरिएको संस्करण',
      specificVersion: 'निर्दिष्ट संस्करण',
      revokeVersion: 'अस्वीकृत संस्करण'
    },
    upgrade: {
      prompt: 'तपाई कुन संस्करण अपग्रेड गर्न योजना गर्नुहुन्छ?',
      confirmPush: 'गोदाममा संस्करणमा पुश गर्ने या नगर्ने'
    },
    specificVersion: {
      prompt: 'कृपया संस्करण नम्बर प्रविष्ट गर्नुहोस्:',
      confirm: 'तपाईंको हालको संस्करण नम्बर हो: v{0}, निश्चित गर्नुहोस् कि तपाईंले निर्दिष्ट संस्करण नम्बर प्रविष्ट गर्नुभयो: v{1}'
    },
    revoke: {
      prompt: 'कुन संस्करण तपाईं रद्द गर्न योजना गर्नुहुन्छ',
      currentVersion: 'हालको संस्करण',
      specificVersion: 'निर्दिष्ट संस्करण'
    },
    revokeCurrentVersion: {
      retainChanges: 'फाइलहरूको परिवर्तन रिजर्भ गर्नुहोस्, केवल संस्करण संख्या खारेज गरिएको छ',
      confirm: 'तपाईंको हालको संस्करण नम्बर हो: v{0}, रद्द पछि: v9 1}, के तपाईं जारी राख्नुहुन्छ?'
    },
    revokeSpecificVersion: {
      prompt: 'कृपया रद्द गर्न संस्करण नम्बर प्रविष्ट गर्नुहोस्:',
      retainChanges: 'फाइलहरूको परिवर्तन रिजर्भ गर्नुहोस्, केवल संस्करण संख्या खारेज गरिएको छ',
      confirm: 'तपाईंको हालको संस्करण नम्बर हो: v{0}, रद्द पछि: v9 1}, के तपाईं जारी राख्नुहुन्छ?'
    },
    revertToPreviousVersion: {
      updatePackageJson: 'प्याकेजको संस्करण संख्या',
      failedToRetrieve:
        'अघिल्लो सबमिशनबाट संस्करण नम्बर पुन: प्राप्त गर्न असम्भव छ, र प्याकेजमा संस्करण नम्बर .json फाईल समयको लागि परिमार्जन गरिएको छैन। यदि आवश्यक छ भने, कृपया म्यानुअल रूपमा परिमार्जन गर्नुहोस्।'
    }
  }
};
