/**
 * 塞尔维亚语：sr_RS
 * @description 塞尔维亚语语言包
 * @author KwooShung，Google Translate
 * @createat 2023-11-03 20:57:04
 */

export default {
  common: {
    error: 'Команда извршења није успела: {0}',
    syncCompleted: 'Потпуно комплетан.',
    invalidChoice: 'Неважећи избор',
    executionSucceeded: 'Егујтирање успева',
    executionFailed: 'Квар о извршењу',
    backToMenu: 'вратити се',
    exit: 'одустати'
  },
  loading: {
    revokingCurrent: 'Тренутна верзија се опозива ...',
    revokingVersion: 'Ревидибилна верзија: В {0} ...',
    specificVersion: 'Наведите верзију као: в {0} ...',
    upgradingVersion: 'Упграде в {0}: в {1}> в {2} ...'
  },
  version: {
    major: 'Главна верзија',
    minor: 'Секундарна верзија',
    patch: 'Закрпа',
    tips: {
      firstTimePrompt: 'Пошто нисте објавили верзију, морате га први пут пустити.',
      failedToIncrement: 'Не може да повећа број верзије',
      invalidVersionField: 'Поља верзија у пакету.јсон недостају или неважећи',
      enterInitialVersion: 'Молимо унесите свој почетни број верзије, подразумевано v{0}:',
      error: 'Молимо унесите ефикасну семантичку верзију број, на пример: В {0}'
    }
  },
  menus: {
    main: {
      prompt: 'Шта ћеш да урадиш?',
      upgradeVersion: 'ажурирана верзија',
      specificVersion: 'Одређена верзија',
      revokeVersion: 'Одбијена верзија'
    },
    upgrade: {
      prompt: 'Коју верзију планирате да надоградите',
      confirmPush: 'Да ли да притиснете верзију у складиште'
    },
    specificVersion: {
      prompt: 'Унесите број верзије:',
      confirm: 'Ваш тренутни број верзије је: в {0}, потврдити да уносите наведену верзију: В {1}'
    },
    revoke: {
      prompt: 'Коју верзију планирате опозвати',
      currentVersion: 'Тренутна верзија',
      specificVersion: 'Одређена верзија'
    },
    revokeCurrentVersion: {
      retainChanges: 'Резервишите промену датотека, одузет је само број верзије',
      confirm: 'Ваш тренутни број верзије је: в {0}, након отказивања: В {1}, да ли наставите?'
    },
    revokeSpecificVersion: {
      prompt: 'Унесите број верзије да бисте се опозвали:',
      retainChanges: 'Резервишите промену датотека, одузет је само број верзије',
      confirm: 'Ваш тренутни број верзије је: в {0}, након отказивања: В {1}, да ли наставите?'
    },
    revertToPreviousVersion: {
      updatePackageJson: 'Да ли је број верзије у пакету.јсон датотеци: В {0} се ажурира као репоцедирана верзија број В {1}',
      failedToRetrieve: 'Немогуће је преузети број верзије из претходне поднеске, а број верзије у датотеци пакета.јсон није модификован за сада. Ако је потребно, молимо модификујте ручно.'
    }
  }
};
