/**
 * 泰米尔语：ta_IN
 * @description 泰米尔语语言包
 * @author KwooShung，Google Translate
 * @createat 2023-11-03 21:00:48
 */

export default {
  common: {
    error: 'மரணதண்டனை கட்டளை தோல்வியடைந்தது: {0}',
    syncCompleted: 'முற்றிலும் முடிந்தது.',
    invalidChoice: 'தவறான தேர்வு',
    executionSucceeded: 'மரணதண்டனை வெற்றி பெறுகிறது',
    executionFailed: 'மரணதண்டனை தோல்வி',
    backToMenu: 'திரும்ப',
    exit: 'விட்டுவிட'
  },
  loading: {
    revokingCurrent: 'தற்போதைய பதிப்பு ரத்து செய்யப்படுகிறது ...',
    revokingVersion: 'மறுபரிசீலனை பதிப்பு: v{0} ...',
    specificVersion: 'பதிப்பை இவ்வாறு குறிப்பிடவும்: v{0} ...',
    upgradingVersion: '{0}: v{1} > v{2} ...'
  },
  version: {
    major: 'முதன்மை பதிப்பு',
    minor: 'இரண்டாம் நிலை பதிப்பு',
    patch: 'இணைப்பு',
    tips: {
      firstTimePrompt: 'நீங்கள் பதிப்பை வெளியிடவில்லை என்பதால், நீங்கள் அதை முதல் முறையாக வெளியிட வேண்டும்.',
      failedToIncrement: 'பதிப்பு எண்ணை அதிகரிக்க முடியாது',
      invalidVersionField: 'Packact.json இல் உள்ள பதிப்பு புலங்கள் காணவில்லை அல்லது செல்லாது',
      enterInitialVersion: 'உங்கள் ஆரம்ப பதிப்பு எண்ணை உள்ளிடவும், இயல்புநிலை 0.0.1:',
      error: 'தயவுசெய்து ஒரு பயனுள்ள சொற்பொருள் பதிப்பு எண்ணை உள்ளிடவும், எடுத்துக்காட்டாக: v{0}'
    }
  },
  menus: {
    main: {
      prompt: 'நீ என்ன செய்ய போகின்றாய்?',
      upgradeVersion: 'புதுப்பிக்கப்பட்ட பதிப்பு',
      specificVersion: 'குறிப்பிட்ட பதிப்பு',
      revokeVersion: 'நிராகரிக்கப்பட்ட பதிப்பு'
    },
    upgrade: {
      prompt: 'எந்த பதிப்பை மேம்படுத்த திட்டமிட்டுள்ளீர்கள்',
      confirmPush: 'பதிப்பை கிடங்கிற்கு தள்ள வேண்டுமா'
    },
    specificVersion: {
      prompt: 'பதிப்பு எண்ணை உள்ளிடவும்:',
      confirm: 'உங்கள் தற்போதைய பதிப்பு எண்: v{0}, நீங்கள் குறிப்பிட்ட பதிப்பு எண்ணை உள்ளிடவும் என்பதை உறுதிப்படுத்தவும்: v{1}'
    },
    revoke: {
      prompt: 'எந்த பதிப்பை ரத்து செய்ய திட்டமிட்டுள்ளீர்கள்',
      currentVersion: 'நடப்பு வடிவம்',
      specificVersion: 'குறிப்பிட்ட பதிப்பு'
    },
    revokeCurrentVersion: {
      retainChanges: 'கோப்புகளின் மாற்றத்தை முன்பதிவு செய்யுங்கள், பதிப்பு எண் மட்டுமே ரத்து செய்யப்படுகிறது',
      confirm: 'உங்கள் தற்போதைய பதிப்பு எண்: v{0}, ரத்து செய்யப்பட்ட பிறகு: v{1}, நீங்கள் தொடர்கிறீர்களா?'
    },
    revokeSpecificVersion: {
      prompt: 'ரத்து செய்யப்பட வேண்டிய பதிப்பு எண்ணை உள்ளிடவும்:',
      retainChanges: 'கோப்புகளின் மாற்றத்தை முன்பதிவு செய்யுங்கள், பதிப்பு எண் மட்டுமே ரத்து செய்யப்படுகிறது',
      confirm: 'உங்கள் தற்போதைய பதிப்பு எண்: v{0}, ரத்து செய்யப்பட்ட பிறகு: v{1}, நீங்கள் தொடர்கிறீர்களா?'
    },
    revertToPreviousVersion: {
      updatePackageJson: 'தொகுப்பில் உள்ள பதிப்பு எண்: v{0} ரத்து செய்யப்பட்ட பதிப்பு எண் V {1 by என புதுப்பிக்கப்பட்டுள்ளதா?',
      failedToRetrieve:
        'முந்தைய சமர்ப்பிப்பிலிருந்து பதிப்பு எண்ணை மீட்டெடுப்பது சாத்தியமில்லை, மேலும் தொகுப்பில் உள்ள பதிப்பு எண். JSON கோப்பில் நேரத்திற்கு மாற்றியமைக்கப்படவில்லை. தேவைப்பட்டால், கைமுறையாக மாற்றவும்.'
    }
  }
};
